Revit 2024 API
BaseLoadOn Enumeration
 An enumerated type listing all the possible power load use types for a space object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum BaseLoadOn
Visual Basic
Public Enumeration BaseLoadOn
Visual C++
public enum class BaseLoadOn
Members
Member name | Description
kUseDefaultLoad |  Return BaseLoadOn is UseDefaultLoad. Obsoleted from 2018, use kBySpaceType instead.
kBySpaceType |  Return BaseLoadOn is BySpaceType.
kUseEnteredLoad |  Return BaseLoadOn is UseEnteredLoad.
kUseCalculatedLoad |  Return BaseLoadOn is UseCalculatedLoad.
kUseActualLoad |  Return BaseLoadOn is UseActualLoad.
kNoOfBaseLoadOnMethods |  Return BaseLoadOn is NoOfBaseLoadOnMethods.
See Also
Autodesk.Revit.DB Namespace